spec/cassettes/Deactivate_Customer_On_Failed_Charge/deactivates_user_with_webhook_from_stripe_for_failed_charge.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_15FZEPFgKcqrRTFp5JGmVHWC
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_Dcc34mbp2qICW467RU70g43W
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.4 p265 (2014-10-27)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        A-Atwals-iMac 14.0.0 Darwin Kernel Version 14.0.0: Fri Sep 19 00:26:44 PDT
        2014; root:xnu-2782.1.97~2/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 30 Dec 2014 23:39:51 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1865'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_dTRuuUwVQnf5YT3f
      Stripe-Version:
      - '2014-11-05'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_15FZEPFgKcqrRTFp5JGmVHWC",
          "created": 1419981413,
          "livemode": false,
          "type": "charge.failed",
          "data": {
            "object": {
              "id": "ch_15FZEPFgKcqrRTFpM4zUKuHF",
              "object": "charge",
              "created": 1419981413,
              "livemode": false,
              "paid": false,
              "amount": 2000,
              "currency": "usd",
              "refunded": false,
              "captured": false,
              "card": {
                "id": "card_15FZ91FgKcqrRTFpOfhXilvV",
                "object": "card",
                "last4": "0341",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2015,
                "fingerprint": "uuue6TsTqTOwV8bx",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "customer": "cus_5Jis7HpQjzW2DV"
              },
              "balance_transaction": null,
              "failure_message": "Your card was declined.",
              "failure_code": "card_declined",
              "amount_refunded": 0,
              "customer": "cus_5Jis7HpQjzW2DV",
              "invoice": null,
              "description": "Manual 2",
              "dispute": null,
              "metadata": {},
              "statement_descriptor": "Manual 2",
              "fraud_details": {},
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_15FZEPFgKcqrRTFpM4zUKuHF/refunds",
                "data": []
              },
              "statement_description": "Manual 2"
            }
          },
          "object": "event",
          "pending_webhooks": 1,
          "request": "iar_5QQ4kTDrFyUJ7J",
          "api_version": "2014-11-05"
        }
    http_version: 
  recorded_at: Tue, 30 Dec 2014 23:39:51 GMT
recorded_with: VCR 2.9.3
